{
  "taxonomies": {
    "Bloom's Taxonomy": {
      "parameters": [
        "Knowledge",
        "Comprehension",
        "Application",
        "Analysis",
        "Synthesis",
        "Evaluation"
      ],
      "source": "https://mason.gmu.edu/~ndabbagh/cehdclass/Resources/IDKB/bloomstax.htm",
      "short_description": "Bloom identified six levels within the cognitive domain, from the simple recall or recognition of facts, as the lowest level, through increasingly more complex and abstract mental levels, to the highest order which is classified as evaluation.",
      "text": "Bloom identified six levels within the cognitive domain, from the simple recall or recognition of facts, as the lowest level, through increasingly more complex and abstract mental levels, to the highest order which is classified as evaluation. A description of the six levels as well as verb examples that represent intellectual activity are listed here.\n\nKnowledge is defined as remembering of previously learned material. This may involve the recall of a wide range of material, from specific facts to complete theories, but all that is required is the bringing to mind of the appropriate information. Knowledge represents the lowest level of learning outcomes in the cognitive domain.\n\nComprehension is defined as the ability to grasp the meaning of material. This may be shown by translating material from one form to another (words to numbers), by interpreting material (explaining or summarizing), and by estimating future trends (predicting consequences or effects). These learning outcomes go one step beyond the simple remembering of material, and represent the lowest level of understanding.\\n\nApplication refers to the ability to use learned material in new and concrete situations. This may include the application of such things as rules, methods, concepts, principles, laws, and theories. Learning outcomes in this area require a higher level of understanding than those under comprehension.\n\nAnalysis refers to the ability to break down material into its component parts so that its organizational structure may be understood. This may include the identification of the parts, analysis of the relationships between parts, and recognition of the organizational principles involved. Learning outcomes here represent a higher intellectual level than comprehension and application because they require an understanding of both the content and the structural form of the material.\n\nSynthesis refers to the ability to put parts together to form a new whole. This may involve the production of a unique communication (theme or speech), a plan of operations (research proposal), or a set of abstract relations (scheme for classifying information). Learning outcomes in this area stress creative behaviors, with major emphasis on the formulation of new patterns or structures.\n\nEvaluation is concerned with the ability to judge the value of material (statement, novel, poem, research report) for a given purpose. The judgements are to be based on definite criteria. These may be internal criteria (organization) or external criteria (relevance to the purpose) and the student may determine the criteria or be given them. Learning outcomes in this area are highest in the cognitive hierarchy because they contain elements of all the other categories, plus conscious value judgements based on clearly defined criteria.",
      "ui_level": "Modular",
      "priority": 1
    },
    "SOLO Taxonomy": {
      "parameters": [
        "Pre-structural",
        "Uni-structural",
        "Multi-structural",
        "Relational",
        "Extended abstract"
      ],
      "source": "https://en.wikipedia.org/wiki/Structure_of_observed_learning_outcome",
      "short_description": "The structure of observed learning outcomes (SOLO) taxonomy is a model that describes levels of increasing complexity in students' understanding of subjects. It was proposed by John B. Biggs and Kevin F. Collis.",
      "text": "The structure of observed learning outcomes (SOLO) taxonomy is a model that describes levels of increasing complexity in students' understanding of subjects. It was proposed by John B. Biggs and Kevin F. Collis.[1]\n\nThe model consists of five levels of understanding:[2]\n\nPre-structural – The task is not attacked appropriately; the student hasn't really understood the point and uses too simple a way of going about it. Students in the pre-structural stage of understanding usually respond to questions with irrelevant comments.\n\nUni-structural – The student's response only focuses on one relevant aspect. Students in the uni-structural stage of understanding usually give slightly relevant but vague answers that lack depth.\n\nMulti-structural – The student's response focuses on several relevant aspects but they are treated independently and additively. Assessment of this level is primarily quantitative. Students in the multi-structural stage may know the concept in tidbits but don't know how to present or explain it.\n\nRelational – The different aspects have become integrated into a coherent whole. This level is what is normally meant by an adequate understanding of some topic. At the relational stage, students can identify various patterns & view a topic from distinct perspectives.\n\nExtended abstract – The previous integrated whole may be conceptualised at a higher level of abstraction and generalised to a new topic or area. At this stage, students may apply the classroom concepts in real life.",
      "ui_level": "Modular",
      "priority": 1
    },
    "Harrow's Taxonomy for the Psychomotor Domain": {
      "parameters": [
        "Reflex movements",
        "Basic fundamental movements",
        "Perceptual abilities",
        "Physical abilities",
        "Skilled movements",
        "Non-discursive communication"
      ],
      "source": "https://mason.gmu.edu/~ndabbagh/cehdclass/Resources/IDKB/harrowstax.htm",
      "short_description": "Anita Harrow's taxonomy for the psychomotor domain is organized according to the degree of coordination including involuntary responses as well as learned capabilities. Simple reflexes begin at the lowest level of the taxonomy, while complex neuromuscular coordination make up the highest levels.",
      "text": "Anita Harrow's taxonomy for the psychomotor domain is organized according to the degree of coordination including involuntary responses as well as learned capabilities. Simple reflexes begin at the lowest level of the taxonomy, while complex neuromuscular coordination make up the highest levels.\n\nReflex movements are actions elicited without learning in response to some stimuli. Examples include: flexion, extension, stretch, postural adjustments.\n\nBasic fundamental movement are inherent movement patterns which are formed by combining of reflex movements and are the basis for complex skilled movements. Examples are: walking, running, pushing, twisting, gripping, grasping, manipulating.\n\nPerceptual refers to interpretation of various stimuli that enable one to make adjustments to the environment. Visual, auditory, kinesthetic, or tactile discrimination. Suggests cognitive as well as psychomotor behavior. Examples include: coordinated movements such as jumping rope, punting, or catching.\n\nPhysical activities require endurance, strength, vigor, and agility which produces a sound, efficiently functioning body. Examples are: all activities which require a) strenuous effort for long periods of time; b) muscular exertion; c) a quick, wide range of motion at the hip joints; and d) quick, precise movements.\n\nSkilled movements are the result of the acquisition of a degree of efficiency when performing a complex task. Examples are: all skilled activities obvious in sports, recreation, and dance.\n\nNon-discursive communication is communication through bodily movements ranging from facial expressions through sophisticated choreographics. Examples include: body postures, gestures, and facial expressions efficiently executed in skilled dance movement and choreographics.",
      "ui_level": "Modular",
      "priority": 1
    },
    "Krathwohl's Affective Domain Taxonomy": {
      "parameters": [
        "Receiving",
        "Responding",
        "Valuing",
        "Organization",
        "Characterization by value"
      ],
      "source": "https://mason.gmu.edu/~ndabbagh/cehdclass/Resources/IDKB/krathstax.htm",
      "short_description": "Krathwohl's affective domain taxonomy is perhaps the best known of any of the affective taxonomies. The taxonomy is ordered according to the principle of internalization. Internalization refers to the process whereby a person's affect toward an object passes from a general awareness level to a point where the affect is 'internalized' and consistently guides or controls the person's behavior.",
      "text": "Krathwohl's affective domain taxonomy is perhaps the best known of any of the affective taxonomies. The taxonomy is ordered according to the principle of internalization. Internalization refers to the process whereby a person's affect toward an object passes from a general awareness level to a point where the affect is 'internalized' and consistently guides or controls the person's behavior.\"\n\nReceiving is being aware of or sensitive to the existence of certain ideas, material, or phenomena and being willing to tolerate them. Examples include: to differentiate, to accept, to listen (for), to respond to.\n\nResponding is committed in some small measure to the ideas, materials, or phenomena involved by actively responding to them. Examples are: to comply with, to follow, to commend, to volunteer, to spend leisure time in, to acclaim.\n\nValuing is willing to be perceived by others as valuing certain ideas, materials, or phenomena. Examples include: to increase measured proficiency in, to relinquish, to subsidize, to support, to debate.\n\nOrganization is to relate the value to those already held and bring it into a harmonious and internally consistent philosophy. Examples are: to discuss, to theorize, to formulate, to balance, to examine.\n\nCharacterization by value or value set is to act consistently in accordance with the values he or she has internalized. Examples include: to revise, to require, to be rated high in the value, to avoid, to resist, to manage, to resolve.",
      "ui_level": "Modular",
      "priority": 1
    },
    "DigComp 2.2 Framework": {
      "parameters": [
        "Information and data literacy",
        "Communication and collaboration",
        "Digital content creation",
        "Safety",
        "Problem solving"
      ],
      "source": "https://joint-research-centre.ec.europa.eu/digcomp/digcomp-framework_en",
      "short_description": "In DigComp, digital competence involves the \"confident, critical and responsible use of, and engagement with, digital technologies for learning, at work, and for participation in society. It is defined as a combination of knowledge, skills and attitudes.",
      "text": "The DigComp framework identifies the key components of digital competence in 5 areas . The areas are summarised below:\n\nInformation and data literacy: To articulate information needs, to locate and retrieve digital data, information and content. To judge the relevance of the source and its content. To store, manage, and organise digital data, information and content.\n\nCommunication and collaboration: To interact, communicate and collaborate through digital technologies while being aware of cultural and generational diversity. To participate in society through public and private digital services and participatory citizenship. To manage one’s digital presence, identity and reputation.\n\nDigital content creation: To create and edit digital content To improve and integrate information and content into an existing body of knowledge while understanding how copyright and licences are to be applied. To know how to give understandable instructions for a computer system.\n\nSafety: To protect devices, content, personal data and privacy in digital environments. To protect physical and psychological health, and to be aware of digital technologies for social well-being and social inclusion. To be aware of the environmental impact of digital technologies and their use.\n\nProblem solving: To identify needs and problems, and to resolve conceptual problems and problem situations in digital environments. To use digital tools to innovate processes and products. To keep up-to-date with the digital evolution.",
      "ui_level": "Standard",
      "priority": 10
    }
  },
  "textContent": {
    "about": "The Universal Learning Goal Inspirational Synthesizer (ULGIS) is an innovative GAI driven platform designed to integrate and synthesize information from original educational taxonomy definitions. Its primary function is to suggest learning goals for students' digital competency development on the basis of the EU framework DigComp 2.2. The output is meant to be facilitating learning goal-oriented discussions in different contexts and at various levels. The ULGIS serves as an inspirational tool for educators and students alike, aiming to optimize the educational development reflections through GAI-driven models.\n\nThe System was developed by Mads Ronald Dahl (CED, Aarhus University) and programmed by Kasper Fyhn Borg (Aarhus University).\n\nContact information: Wiz@AU.DK"
  }
}
